#+Title: Writing Reproducible Reports
*** Tables. 

    Pretty much happens automatically. You may have to play with the /header/ [[https://orgmode.org/manual/Header-arguments.html#Header-arguments][arguments]] to get exactly the look you want. The /header/ arguments are those things appearing on the ~+#Begin_Src~ line. 

    #+begin_src R :session *tableTest* :colnames yes :exports both
      d <- data.frame(foo=c('a','b','n'), bar=c(1.0/3.0,22,32))
      d
    #+end_src

    #+RESULTS:
    | foo |               bar |
    |-----+-------------------|
    | a   | 0.333333333333333 |
    | b   |                22 |
    | n   |                32 |

    Try adding this to your prior file just to make sure you can get the table to execute. 
